# BaseEquipmentConnector Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPSystem..::..BaseEquipmentConnector Property
MEPSystem Class See Also
---
The connector within base equipment which is used to connect with system.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Connector BaseEquipmentConnector { get; }
```

Visual Basic
---
```text
Public ReadOnly Property BaseEquipmentConnector As Connector
	Get
```

Visual C++
---
```text
public:
property Connector^ BaseEquipmentConnector {
	Connector^ get ();
}
```

# ### Return Value
Returns the connector which connects with the system within base equipment if base equipment has been assigned to system, otherwise returns nullNothingnullptra null reference (Nothing in Visual Basic).
# See Also
MEPSystem Class
Autodesk.Revit.DB Namespace